Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDom_reg.h
/** \brief 50, SCI ${i} Error Address Capture Register */
#define DOM1_SCICTRL2_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xF8708050u)
/** Alias (User Manual Name) for DOM1_SCICTRL2_ERRADDR.
* To use register names with standard convension, please use DOM1_SCICTRL2_ERRADDR.
*/
#define DOM1_ERRADDR2 (DOM1_SCICTRL2_ERRADDR)

/** \brief 58, SCI ${i} Error Capture Register */
#define DOM1_SCICTRL2_ERR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xF8708058u)
/** Alias (User Manual Name) for DOM1_SCICTRL2_ERR.
* To use register names with standard convension, please use DOM1_SCICTRL2_ERR.
*/
#define DOM1_ERR2 (DOM1_SCICTRL2_ERR)

/** \brief 60, Protocol Error Control Register ${i} */
#define DOM1_SCICTRL3_PECON /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xF8708060u)
/** Alias (User Manual Name) for DOM1_SCICTRL3_PECON.
* To use register names with standard convension, please use DOM1_SCICTRL3_PECON.
*/
#define DOM1_PECON3 (DOM1_SCICTRL3_PECON)

/** \brief 68, SCI ${i} Arbiter Priority Register */
#define DOM1_SCICTRL3_PRIORITY /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xF8708068u)
/** Alias (User Manual Name) for DOM1_SCICTRL3_PRIORITY.
* To use register names with standard convension, please use DOM1_SCICTRL3_PRIORITY.
*/
#define DOM1_PRIORITY3 (DOM1_SCICTRL3_PRIORITY)

/** \brief 70, SCI ${i} Error Address Capture Register */
#define DOM1_SCICTRL3_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xF8708070u)
/** Alias (User Manual Name) for DOM1_SCICTRL3_ERRADDR.
* To use register names with standard convension, please use DOM1_SCICTRL3_ERRADDR.
*/
#define DOM1_ERRADDR3 (DOM1_SCICTRL3_ERRADDR)

/** \brief 78, SCI ${i} Error Capture Register */
#define DOM1_SCICTRL3_ERR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xF8708078u)
/** Alias (User Manual Name) for DOM1_SCICTRL3_ERR.
* To use register names with standard convension, please use DOM1_SCICTRL3_ERR.
*/
#define DOM1_ERR3 (DOM1_SCICTRL3_ERR)

/** \brief 80, Protocol Error Control Register ${i} */
#define DOM1_SCICTRL4_PECON /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xF8708080u)
/** Alias (User Manual Name) for DOM1_SCICTRL4_PECON.
* To use register names with standard convension, please use DOM1_SCICTRL4_PECON.
*/
#define DOM1_PECON4 (DOM1_SCICTRL4_PECON)

/** \brief 88, SCI ${i} Arbiter Priority Register */
#define DOM1_SCICTRL4_PRIORITY /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xF8708088u)
/** Alias (User Manual Name) for DOM1_SCICTRL4_PRIORITY.
* To use register names with standard convension, please use DOM1_SCICTRL4_PRIORITY.
*/
#define DOM1_PRIORITY4 (DOM1_SCICTRL4_PRIORITY)

/** \brief 90, SCI ${i} Error Address Capture Register */
#define DOM1_SCICTRL4_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xF8708090u)
/** Alias (User Manual Name) for DOM1_SCICTRL4_ERRADDR.
* To use register names with standard convension, please use DOM1_SCICTRL4_ERRADDR.
*/
#define DOM1_ERRADDR4 (DOM1_SCICTRL4_ERRADDR)

/** \brief 98, SCI ${i} Error Capture Register */
#define DOM1_SCICTRL4_ERR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xF8708098u)
/** Alias (User Manual Name) for DOM1_SCICTRL4_ERR.
* To use register names with standard convension, please use DOM1_SCICTRL4_ERR.
*/
#define DOM1_ERR4 (DOM1_SCICTRL4_ERR)

/** \brief A0, Protocol Error Control Register ${i} */
#define DOM1_SCICTRL5_PECON /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xF87080A0u)
/** Alias (User Manual Name) for DOM1_SCICTRL5_PECON.
* To use register names with standard convension, please use DOM1_SCICTRL5_PECON.
*/
#define DOM1_PECON5 (DOM1_SCICTRL5_PECON)

/** \brief A8, SCI ${i} Arbiter Priority Register */
#define DOM1_SCICTRL5_PRIORITY /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xF87080A8u)
/** Alias (User Manual Name) for DOM1_SCICTRL5_PRIORITY.
* To use register names with standard convension, please use DOM1_SCICTRL5_PRIORITY.
*/
#define DOM1_PRIORITY5 (DOM1_SCICTRL5_PRIORITY)

/** \brief B0, SCI ${i} Error Address Capture Register */
#define DOM1_SCICTRL5_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xF87080B0u)
/** Alias (User Manual Name) for DOM1_SCICTRL5_ERRADDR.
* To use register names with standard convension, please use DOM1_SCICTRL5_ERRADDR.
*/
#define DOM1_ERRADDR5 (DOM1_SCICTRL5_ERRADDR)

/** \brief B8, SCI ${i} Error Capture Register */
#define DOM1_SCICTRL5_ERR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xF87080B8u)
/** Alias (User Manual Name) for DOM1_SCICTRL5_ERR.
* To use register names with standard convension, please use DOM1_SCICTRL5_ERR.
*/
#define DOM1_ERR5 (DOM1_SCICTRL5_ERR)

/** \brief C0, Protocol Error Control Register ${i} */
#define DOM1_SCICTRL6_PECON /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xF87080C0u)
/** Alias (User Manual Name) for DOM1_SCICTRL6_PECON.
* To use register names with standard convension, please use DOM1_SCICTRL6_PECON.
*/
#define DOM1_PECON6 (DOM1_SCICTRL6_PECON)

/** \brief C8, SCI ${i} Arbiter Priority Register */
#define DOM1_SCICTRL6_PRIORITY /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xF87080C8u)
/** Alias (User Manual Name) for DOM1_SCICTRL6_PRIORITY.
* To use register names with standard convension, please use DOM1_SCICTRL6_PRIORITY.
*/
#define DOM1_PRIORITY6 (DOM1_SCICTRL6_PRIORITY)

/** \brief D0, SCI ${i} Error Address Capture Register */
#define DOM1_SCICTRL6_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xF87080D0u)
/** Alias (User Manual Name) for DOM1_SCICTRL6_ERRADDR.
* To use register names with standard convension, please use DOM1_SCICTRL6_ERRADDR.
*/
#define DOM1_ERRADDR6 (DOM1_SCICTRL6_ERRADDR)

/** \brief D8, SCI ${i} Error Capture Register */
#define DOM1_SCICTRL6_ERR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xF87080D8u)
/** Alias (User Manual Name) for DOM1_SCICTRL6_ERR.
* To use register names with standard convension, please use DOM1_SCICTRL6_ERR.
*/
#define DOM1_ERR6 (DOM1_SCICTRL6_ERR)

/** \brief E0, Protocol Error Control Register ${i} */
#define DOM1_SCICTRL7_PECON /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xF87080E0u)
/** Alias (User Manual Name) for DOM1_SCICTRL7_PECON.
* To use register names with standard convension, please use DOM1_SCICTRL7_PECON.
*/
#define DOM1_PECON7 (DOM1_SCICTRL7_PECON)

/** \brief E8, SCI ${i} Arbiter Priority Register */
#define DOM1_SCICTRL7_PRIORITY /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xF87080E8u)
/** Alias (User Manual Name) for DOM1_SCICTRL7_PRIORITY.
* To use register names with standard convension, please use DOM1_SCICTRL7_PRIORITY.
*/
#define DOM1_PRIORITY7 (DOM1_SCICTRL7_PRIORITY)

/** \brief F0, SCI ${i} Error Address Capture Register */
#define DOM1_SCICTRL7_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xF87080F0u)
/** Alias (User Manual Name) for DOM1_SCICTRL7_ERRADDR.
* To use register names with standard convension, please use DOM1_SCICTRL7_ERRADDR.
*/
#define DOM1_ERRADDR7 (DOM1_SCICTRL7_ERRADDR)

/** \brief F8, SCI ${i} Error Capture Register */
#define DOM1_SCICTRL7_ERR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xF87080F8u)
/** Alias (User Manual Name) for DOM1_SCICTRL7_ERR.
* To use register names with standard convension, please use DOM1_SCICTRL7_ERR.
*/
#define DOM1_ERR7 (DOM1_SCICTRL7_ERR)

/** \brief 100, Protocol Error Control Register ${i} */
#define DOM1_SCICTRL8_PECON /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xF8708100u)
/** Alias (User Manual Name) for DOM1_SCICTRL8_PECON.
* To use register names with standard convension, please use DOM1_SCICTRL8_PECON.
*/
#define DOM1_PECON8 (DOM1_SCICTRL8_PECON)

/** \brief 108, SCI ${i} Arbiter Priority Register */
#define DOM1_SCICTRL8_PRIORITY /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xF8708108u)
/** Alias (User Manual Name) for DOM1_SCICTRL8_PRIORITY.
* To use register names with standard convension, please use DOM1_SCICTRL8_PRIORITY.
*/
#define DOM1_PRIORITY8 (DOM1_SCICTRL8_PRIORITY)

