Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDom_reg.h
/** \brief 110, SCI ${i} Error Address Capture Register */
#define DOM1_SCICTRL8_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xF8708110u)
/** Alias (User Manual Name) for DOM1_SCICTRL8_ERRADDR.
* To use register names with standard convension, please use DOM1_SCICTRL8_ERRADDR.
*/
#define DOM1_ERRADDR8 (DOM1_SCICTRL8_ERRADDR)

/** \brief 118, SCI ${i} Error Capture Register */
#define DOM1_SCICTRL8_ERR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xF8708118u)
/** Alias (User Manual Name) for DOM1_SCICTRL8_ERR.
* To use register names with standard convension, please use DOM1_SCICTRL8_ERR.
*/
#define DOM1_ERR8 (DOM1_SCICTRL8_ERR)

/** \brief 120, Protocol Error Control Register ${i} */
#define DOM1_SCICTRL9_PECON /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xF8708120u)
/** Alias (User Manual Name) for DOM1_SCICTRL9_PECON.
* To use register names with standard convension, please use DOM1_SCICTRL9_PECON.
*/
#define DOM1_PECON9 (DOM1_SCICTRL9_PECON)

/** \brief 128, SCI ${i} Arbiter Priority Register */
#define DOM1_SCICTRL9_PRIORITY /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xF8708128u)
/** Alias (User Manual Name) for DOM1_SCICTRL9_PRIORITY.
* To use register names with standard convension, please use DOM1_SCICTRL9_PRIORITY.
*/
#define DOM1_PRIORITY9 (DOM1_SCICTRL9_PRIORITY)

/** \brief 130, SCI ${i} Error Address Capture Register */
#define DOM1_SCICTRL9_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xF8708130u)
/** Alias (User Manual Name) for DOM1_SCICTRL9_ERRADDR.
* To use register names with standard convension, please use DOM1_SCICTRL9_ERRADDR.
*/
#define DOM1_ERRADDR9 (DOM1_SCICTRL9_ERRADDR)

/** \brief 138, SCI ${i} Error Capture Register */
#define DOM1_SCICTRL9_ERR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xF8708138u)
/** Alias (User Manual Name) for DOM1_SCICTRL9_ERR.
* To use register names with standard convension, please use DOM1_SCICTRL9_ERR.
*/
#define DOM1_ERR9 (DOM1_SCICTRL9_ERR)

/** \brief 140, Protocol Error Control Register ${i} */
#define DOM1_SCICTRL10_PECON /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xF8708140u)
/** Alias (User Manual Name) for DOM1_SCICTRL10_PECON.
* To use register names with standard convension, please use DOM1_SCICTRL10_PECON.
*/
#define DOM1_PECON10 (DOM1_SCICTRL10_PECON)

/** \brief 148, SCI ${i} Arbiter Priority Register */
#define DOM1_SCICTRL10_PRIORITY /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xF8708148u)
/** Alias (User Manual Name) for DOM1_SCICTRL10_PRIORITY.
* To use register names with standard convension, please use DOM1_SCICTRL10_PRIORITY.
*/
#define DOM1_PRIORITY10 (DOM1_SCICTRL10_PRIORITY)

/** \brief 150, SCI ${i} Error Address Capture Register */
#define DOM1_SCICTRL10_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xF8708150u)
/** Alias (User Manual Name) for DOM1_SCICTRL10_ERRADDR.
* To use register names with standard convension, please use DOM1_SCICTRL10_ERRADDR.
*/
#define DOM1_ERRADDR10 (DOM1_SCICTRL10_ERRADDR)

/** \brief 158, SCI ${i} Error Capture Register */
#define DOM1_SCICTRL10_ERR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xF8708158u)
/** Alias (User Manual Name) for DOM1_SCICTRL10_ERR.
* To use register names with standard convension, please use DOM1_SCICTRL10_ERR.
*/
#define DOM1_ERR10 (DOM1_SCICTRL10_ERR)

/** \brief 160, Protocol Error Control Register ${i} */
#define DOM1_SCICTRL11_PECON /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xF8708160u)
/** Alias (User Manual Name) for DOM1_SCICTRL11_PECON.
* To use register names with standard convension, please use DOM1_SCICTRL11_PECON.
*/
#define DOM1_PECON11 (DOM1_SCICTRL11_PECON)

/** \brief 168, SCI ${i} Arbiter Priority Register */
#define DOM1_SCICTRL11_PRIORITY /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xF8708168u)
/** Alias (User Manual Name) for DOM1_SCICTRL11_PRIORITY.
* To use register names with standard convension, please use DOM1_SCICTRL11_PRIORITY.
*/
#define DOM1_PRIORITY11 (DOM1_SCICTRL11_PRIORITY)

/** \brief 170, SCI ${i} Error Address Capture Register */
#define DOM1_SCICTRL11_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xF8708170u)
/** Alias (User Manual Name) for DOM1_SCICTRL11_ERRADDR.
* To use register names with standard convension, please use DOM1_SCICTRL11_ERRADDR.
*/
#define DOM1_ERRADDR11 (DOM1_SCICTRL11_ERRADDR)

/** \brief 178, SCI ${i} Error Capture Register */
#define DOM1_SCICTRL11_ERR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xF8708178u)
/** Alias (User Manual Name) for DOM1_SCICTRL11_ERR.
* To use register names with standard convension, please use DOM1_SCICTRL11_ERR.
*/
#define DOM1_ERR11 (DOM1_SCICTRL11_ERR)

/** \brief 180, Protocol Error Control Register ${i} */
#define DOM1_SCICTRL12_PECON /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xF8708180u)
/** Alias (User Manual Name) for DOM1_SCICTRL12_PECON.
* To use register names with standard convension, please use DOM1_SCICTRL12_PECON.
*/
#define DOM1_PECON12 (DOM1_SCICTRL12_PECON)

/** \brief 188, SCI ${i} Arbiter Priority Register */
#define DOM1_SCICTRL12_PRIORITY /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xF8708188u)
/** Alias (User Manual Name) for DOM1_SCICTRL12_PRIORITY.
* To use register names with standard convension, please use DOM1_SCICTRL12_PRIORITY.
*/
#define DOM1_PRIORITY12 (DOM1_SCICTRL12_PRIORITY)

/** \brief 190, SCI ${i} Error Address Capture Register */
#define DOM1_SCICTRL12_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xF8708190u)
/** Alias (User Manual Name) for DOM1_SCICTRL12_ERRADDR.
* To use register names with standard convension, please use DOM1_SCICTRL12_ERRADDR.
*/
#define DOM1_ERRADDR12 (DOM1_SCICTRL12_ERRADDR)

/** \brief 198, SCI ${i} Error Capture Register */
#define DOM1_SCICTRL12_ERR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xF8708198u)
/** Alias (User Manual Name) for DOM1_SCICTRL12_ERR.
* To use register names with standard convension, please use DOM1_SCICTRL12_ERR.
*/
#define DOM1_ERR12 (DOM1_SCICTRL12_ERR)

/** \brief 1A0, Protocol Error Control Register ${i} */
#define DOM1_SCICTRL13_PECON /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xF87081A0u)
/** Alias (User Manual Name) for DOM1_SCICTRL13_PECON.
* To use register names with standard convension, please use DOM1_SCICTRL13_PECON.
*/
#define DOM1_PECON13 (DOM1_SCICTRL13_PECON)

/** \brief 1A8, SCI ${i} Arbiter Priority Register */
#define DOM1_SCICTRL13_PRIORITY /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xF87081A8u)
/** Alias (User Manual Name) for DOM1_SCICTRL13_PRIORITY.
* To use register names with standard convension, please use DOM1_SCICTRL13_PRIORITY.
*/
#define DOM1_PRIORITY13 (DOM1_SCICTRL13_PRIORITY)

/** \brief 1B0, SCI ${i} Error Address Capture Register */
#define DOM1_SCICTRL13_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xF87081B0u)
/** Alias (User Manual Name) for DOM1_SCICTRL13_ERRADDR.
* To use register names with standard convension, please use DOM1_SCICTRL13_ERRADDR.
*/
#define DOM1_ERRADDR13 (DOM1_SCICTRL13_ERRADDR)

/** \brief 1B8, SCI ${i} Error Capture Register */
#define DOM1_SCICTRL13_ERR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xF87081B8u)
/** Alias (User Manual Name) for DOM1_SCICTRL13_ERR.
* To use register names with standard convension, please use DOM1_SCICTRL13_ERR.
*/
#define DOM1_ERR13 (DOM1_SCICTRL13_ERR)

/** \brief 1C0, Protocol Error Control Register ${i} */
#define DOM1_SCICTRL14_PECON /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xF87081C0u)
/** Alias (User Manual Name) for DOM1_SCICTRL14_PECON.
* To use register names with standard convension, please use DOM1_SCICTRL14_PECON.
*/
#define DOM1_PECON14 (DOM1_SCICTRL14_PECON)

/** \brief 1C8, SCI ${i} Arbiter Priority Register */
#define DOM1_SCICTRL14_PRIORITY /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xF87081C8u)
/** Alias (User Manual Name) for DOM1_SCICTRL14_PRIORITY.
* To use register names with standard convension, please use DOM1_SCICTRL14_PRIORITY.
*/
#define DOM1_PRIORITY14 (DOM1_SCICTRL14_PRIORITY)

