Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDom_reg.h
/** \brief 1D0, SCI ${i} Error Address Capture Register */
#define DOM1_SCICTRL14_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xF87081D0u)
/** Alias (User Manual Name) for DOM1_SCICTRL14_ERRADDR.
* To use register names with standard convension, please use DOM1_SCICTRL14_ERRADDR.
*/
#define DOM1_ERRADDR14 (DOM1_SCICTRL14_ERRADDR)

/** \brief 1D8, SCI ${i} Error Capture Register */
#define DOM1_SCICTRL14_ERR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xF87081D8u)
/** Alias (User Manual Name) for DOM1_SCICTRL14_ERR.
* To use register names with standard convension, please use DOM1_SCICTRL14_ERR.
*/
#define DOM1_ERR14 (DOM1_SCICTRL14_ERR)

/** \brief 1E0, Protocol Error Control Register ${i} */
#define DOM1_SCICTRL15_PECON /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xF87081E0u)
/** Alias (User Manual Name) for DOM1_SCICTRL15_PECON.
* To use register names with standard convension, please use DOM1_SCICTRL15_PECON.
*/
#define DOM1_PECON15 (DOM1_SCICTRL15_PECON)

/** \brief 1E8, SCI ${i} Arbiter Priority Register */
#define DOM1_SCICTRL15_PRIORITY /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xF87081E8u)
/** Alias (User Manual Name) for DOM1_SCICTRL15_PRIORITY.
* To use register names with standard convension, please use DOM1_SCICTRL15_PRIORITY.
*/
#define DOM1_PRIORITY15 (DOM1_SCICTRL15_PRIORITY)

/** \brief 1F0, SCI ${i} Error Address Capture Register */
#define DOM1_SCICTRL15_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xF87081F0u)
/** Alias (User Manual Name) for DOM1_SCICTRL15_ERRADDR.
* To use register names with standard convension, please use DOM1_SCICTRL15_ERRADDR.
*/
#define DOM1_ERRADDR15 (DOM1_SCICTRL15_ERRADDR)

/** \brief 1F8, SCI ${i} Error Capture Register */
#define DOM1_SCICTRL15_ERR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xF87081F8u)
/** Alias (User Manual Name) for DOM1_SCICTRL15_ERR.
* To use register names with standard convension, please use DOM1_SCICTRL15_ERR.
*/
#define DOM1_ERR15 (DOM1_SCICTRL15_ERR)

/** \brief 408, Identification Register */
#define DOM1_ID /*lint --e(923)*/ (*(volatile Ifx_DOM_ID*)0xF8708408u)

/** \brief 410, Protocol Error Status Register */
#define DOM1_PESTAT /*lint --e(923)*/ (*(volatile Ifx_DOM_PESTAT*)0xF8708410u)

/** \brief 418, Transaction ID Status Register */
#define DOM1_TIDSTAT /*lint --e(923)*/ (*(volatile Ifx_DOM_TIDSTAT*)0xF8708418u)

/** \brief 420, Transaction ID Enable Register */
#define DOM1_TIDEN /*lint --e(923)*/ (*(volatile Ifx_DOM_TIDEN*)0xF8708420u)

/** \brief 430,  */
#define DOM1_BRCON /*lint --e(923)*/ (*(volatile Ifx_DOM_BRCON*)0xF8708430u)

/** \brief 4F0, Access Enable Register 0 */
#define DOM1_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_DOM_ACCEN0*)0xF87084F0u)

/** \brief 4F8, Access Enable Register 1 */
#define DOM1_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_DOM_ACCEN1*)0xF87084F8u)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Dom_Cfg_Domed
 * \{  */
/** \brief 0, Protocol Error Control Register ${i} */
#define DOMED_SCICTRL0_PECON /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB700000u)
/** Alias (User Manual Name) for DOMED_SCICTRL0_PECON.
* To use register names with standard convension, please use DOMED_SCICTRL0_PECON.
*/
#define DOMED_PECON0 (DOMED_SCICTRL0_PECON)

/** \brief 8, SCI ${i} Arbiter Priority Register */
#define DOMED_SCICTRL0_PRIORITY /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB700008u)
/** Alias (User Manual Name) for DOMED_SCICTRL0_PRIORITY.
* To use register names with standard convension, please use DOMED_SCICTRL0_PRIORITY.
*/
#define DOMED_PRIORITY0 (DOMED_SCICTRL0_PRIORITY)

/** \brief 10, SCI ${i} Error Address Capture Register */
#define DOMED_SCICTRL0_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB700010u)
/** Alias (User Manual Name) for DOMED_SCICTRL0_ERRADDR.
* To use register names with standard convension, please use DOMED_SCICTRL0_ERRADDR.
*/
#define DOMED_ERRADDR0 (DOMED_SCICTRL0_ERRADDR)

/** \brief 18, SCI ${i} Error Capture Register */
#define DOMED_SCICTRL0_ERR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB700018u)
/** Alias (User Manual Name) for DOMED_SCICTRL0_ERR.
* To use register names with standard convension, please use DOMED_SCICTRL0_ERR.
*/
#define DOMED_ERR0 (DOMED_SCICTRL0_ERR)

/** \brief 20, Protocol Error Control Register ${i} */
#define DOMED_SCICTRL1_PECON /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB700020u)
/** Alias (User Manual Name) for DOMED_SCICTRL1_PECON.
* To use register names with standard convension, please use DOMED_SCICTRL1_PECON.
*/
#define DOMED_PECON1 (DOMED_SCICTRL1_PECON)

/** \brief 28, SCI ${i} Arbiter Priority Register */
#define DOMED_SCICTRL1_PRIORITY /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB700028u)
/** Alias (User Manual Name) for DOMED_SCICTRL1_PRIORITY.
* To use register names with standard convension, please use DOMED_SCICTRL1_PRIORITY.
*/
#define DOMED_PRIORITY1 (DOMED_SCICTRL1_PRIORITY)

/** \brief 30, SCI ${i} Error Address Capture Register */
#define DOMED_SCICTRL1_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB700030u)
/** Alias (User Manual Name) for DOMED_SCICTRL1_ERRADDR.
* To use register names with standard convension, please use DOMED_SCICTRL1_ERRADDR.
*/
#define DOMED_ERRADDR1 (DOMED_SCICTRL1_ERRADDR)

/** \brief 38, SCI ${i} Error Capture Register */
#define DOMED_SCICTRL1_ERR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB700038u)
/** Alias (User Manual Name) for DOMED_SCICTRL1_ERR.
* To use register names with standard convension, please use DOMED_SCICTRL1_ERR.
*/
#define DOMED_ERR1 (DOMED_SCICTRL1_ERR)

/** \brief 40, Protocol Error Control Register ${i} */
#define DOMED_SCICTRL2_PECON /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB700040u)
/** Alias (User Manual Name) for DOMED_SCICTRL2_PECON.
* To use register names with standard convension, please use DOMED_SCICTRL2_PECON.
*/
#define DOMED_PECON2 (DOMED_SCICTRL2_PECON)

/** \brief 48, SCI ${i} Arbiter Priority Register */
#define DOMED_SCICTRL2_PRIORITY /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB700048u)
/** Alias (User Manual Name) for DOMED_SCICTRL2_PRIORITY.
* To use register names with standard convension, please use DOMED_SCICTRL2_PRIORITY.
*/
#define DOMED_PRIORITY2 (DOMED_SCICTRL2_PRIORITY)

