Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDom_reg.h
/** \brief 50, SCI ${i} Error Address Capture Register */
#define DOMED_SCICTRL2_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB700050u)
/** Alias (User Manual Name) for DOMED_SCICTRL2_ERRADDR.
* To use register names with standard convension, please use DOMED_SCICTRL2_ERRADDR.
*/
#define DOMED_ERRADDR2 (DOMED_SCICTRL2_ERRADDR)

/** \brief 58, SCI ${i} Error Capture Register */
#define DOMED_SCICTRL2_ERR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB700058u)
/** Alias (User Manual Name) for DOMED_SCICTRL2_ERR.
* To use register names with standard convension, please use DOMED_SCICTRL2_ERR.
*/
#define DOMED_ERR2 (DOMED_SCICTRL2_ERR)

/** \brief 60, Protocol Error Control Register ${i} */
#define DOMED_SCICTRL3_PECON /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB700060u)
/** Alias (User Manual Name) for DOMED_SCICTRL3_PECON.
* To use register names with standard convension, please use DOMED_SCICTRL3_PECON.
*/
#define DOMED_PECON3 (DOMED_SCICTRL3_PECON)

/** \brief 68, SCI ${i} Arbiter Priority Register */
#define DOMED_SCICTRL3_PRIORITY /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB700068u)
/** Alias (User Manual Name) for DOMED_SCICTRL3_PRIORITY.
* To use register names with standard convension, please use DOMED_SCICTRL3_PRIORITY.
*/
#define DOMED_PRIORITY3 (DOMED_SCICTRL3_PRIORITY)

/** \brief 70, SCI ${i} Error Address Capture Register */
#define DOMED_SCICTRL3_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB700070u)
/** Alias (User Manual Name) for DOMED_SCICTRL3_ERRADDR.
* To use register names with standard convension, please use DOMED_SCICTRL3_ERRADDR.
*/
#define DOMED_ERRADDR3 (DOMED_SCICTRL3_ERRADDR)

/** \brief 78, SCI ${i} Error Capture Register */
#define DOMED_SCICTRL3_ERR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB700078u)
/** Alias (User Manual Name) for DOMED_SCICTRL3_ERR.
* To use register names with standard convension, please use DOMED_SCICTRL3_ERR.
*/
#define DOMED_ERR3 (DOMED_SCICTRL3_ERR)

/** \brief 80, Protocol Error Control Register ${i} */
#define DOMED_SCICTRL4_PECON /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB700080u)
/** Alias (User Manual Name) for DOMED_SCICTRL4_PECON.
* To use register names with standard convension, please use DOMED_SCICTRL4_PECON.
*/
#define DOMED_PECON4 (DOMED_SCICTRL4_PECON)

/** \brief 88, SCI ${i} Arbiter Priority Register */
#define DOMED_SCICTRL4_PRIORITY /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB700088u)
/** Alias (User Manual Name) for DOMED_SCICTRL4_PRIORITY.
* To use register names with standard convension, please use DOMED_SCICTRL4_PRIORITY.
*/
#define DOMED_PRIORITY4 (DOMED_SCICTRL4_PRIORITY)

/** \brief 90, SCI ${i} Error Address Capture Register */
#define DOMED_SCICTRL4_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB700090u)
/** Alias (User Manual Name) for DOMED_SCICTRL4_ERRADDR.
* To use register names with standard convension, please use DOMED_SCICTRL4_ERRADDR.
*/
#define DOMED_ERRADDR4 (DOMED_SCICTRL4_ERRADDR)

/** \brief 98, SCI ${i} Error Capture Register */
#define DOMED_SCICTRL4_ERR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB700098u)
/** Alias (User Manual Name) for DOMED_SCICTRL4_ERR.
* To use register names with standard convension, please use DOMED_SCICTRL4_ERR.
*/
#define DOMED_ERR4 (DOMED_SCICTRL4_ERR)

/** \brief A0, Protocol Error Control Register ${i} */
#define DOMED_SCICTRL5_PECON /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB7000A0u)
/** Alias (User Manual Name) for DOMED_SCICTRL5_PECON.
* To use register names with standard convension, please use DOMED_SCICTRL5_PECON.
*/
#define DOMED_PECON5 (DOMED_SCICTRL5_PECON)

/** \brief A8, SCI ${i} Arbiter Priority Register */
#define DOMED_SCICTRL5_PRIORITY /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB7000A8u)
/** Alias (User Manual Name) for DOMED_SCICTRL5_PRIORITY.
* To use register names with standard convension, please use DOMED_SCICTRL5_PRIORITY.
*/
#define DOMED_PRIORITY5 (DOMED_SCICTRL5_PRIORITY)

/** \brief B0, SCI ${i} Error Address Capture Register */
#define DOMED_SCICTRL5_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB7000B0u)
/** Alias (User Manual Name) for DOMED_SCICTRL5_ERRADDR.
* To use register names with standard convension, please use DOMED_SCICTRL5_ERRADDR.
*/
#define DOMED_ERRADDR5 (DOMED_SCICTRL5_ERRADDR)

/** \brief B8, SCI ${i} Error Capture Register */
#define DOMED_SCICTRL5_ERR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB7000B8u)
/** Alias (User Manual Name) for DOMED_SCICTRL5_ERR.
* To use register names with standard convension, please use DOMED_SCICTRL5_ERR.
*/
#define DOMED_ERR5 (DOMED_SCICTRL5_ERR)

/** \brief C0, Protocol Error Control Register ${i} */
#define DOMED_SCICTRL6_PECON /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB7000C0u)
/** Alias (User Manual Name) for DOMED_SCICTRL6_PECON.
* To use register names with standard convension, please use DOMED_SCICTRL6_PECON.
*/
#define DOMED_PECON6 (DOMED_SCICTRL6_PECON)

/** \brief C8, SCI ${i} Arbiter Priority Register */
#define DOMED_SCICTRL6_PRIORITY /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB7000C8u)
/** Alias (User Manual Name) for DOMED_SCICTRL6_PRIORITY.
* To use register names with standard convension, please use DOMED_SCICTRL6_PRIORITY.
*/
#define DOMED_PRIORITY6 (DOMED_SCICTRL6_PRIORITY)

/** \brief D0, SCI ${i} Error Address Capture Register */
#define DOMED_SCICTRL6_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB7000D0u)
/** Alias (User Manual Name) for DOMED_SCICTRL6_ERRADDR.
* To use register names with standard convension, please use DOMED_SCICTRL6_ERRADDR.
*/
#define DOMED_ERRADDR6 (DOMED_SCICTRL6_ERRADDR)

/** \brief D8, SCI ${i} Error Capture Register */
#define DOMED_SCICTRL6_ERR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB7000D8u)
/** Alias (User Manual Name) for DOMED_SCICTRL6_ERR.
* To use register names with standard convension, please use DOMED_SCICTRL6_ERR.
*/
#define DOMED_ERR6 (DOMED_SCICTRL6_ERR)

/** \brief E0, Protocol Error Control Register ${i} */
#define DOMED_SCICTRL7_PECON /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB7000E0u)
/** Alias (User Manual Name) for DOMED_SCICTRL7_PECON.
* To use register names with standard convension, please use DOMED_SCICTRL7_PECON.
*/
#define DOMED_PECON7 (DOMED_SCICTRL7_PECON)

/** \brief E8, SCI ${i} Arbiter Priority Register */
#define DOMED_SCICTRL7_PRIORITY /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB7000E8u)
/** Alias (User Manual Name) for DOMED_SCICTRL7_PRIORITY.
* To use register names with standard convension, please use DOMED_SCICTRL7_PRIORITY.
*/
#define DOMED_PRIORITY7 (DOMED_SCICTRL7_PRIORITY)

/** \brief F0, SCI ${i} Error Address Capture Register */
#define DOMED_SCICTRL7_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB7000F0u)
/** Alias (User Manual Name) for DOMED_SCICTRL7_ERRADDR.
* To use register names with standard convension, please use DOMED_SCICTRL7_ERRADDR.
*/
#define DOMED_ERRADDR7 (DOMED_SCICTRL7_ERRADDR)

/** \brief F8, SCI ${i} Error Capture Register */
#define DOMED_SCICTRL7_ERR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB7000F8u)
/** Alias (User Manual Name) for DOMED_SCICTRL7_ERR.
* To use register names with standard convension, please use DOMED_SCICTRL7_ERR.
*/
#define DOMED_ERR7 (DOMED_SCICTRL7_ERR)

/** \brief 100, Protocol Error Control Register ${i} */
#define DOMED_SCICTRL8_PECON /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB700100u)
/** Alias (User Manual Name) for DOMED_SCICTRL8_PECON.
* To use register names with standard convension, please use DOMED_SCICTRL8_PECON.
*/
#define DOMED_PECON8 (DOMED_SCICTRL8_PECON)

/** \brief 108, SCI ${i} Arbiter Priority Register */
#define DOMED_SCICTRL8_PRIORITY /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB700108u)
/** Alias (User Manual Name) for DOMED_SCICTRL8_PRIORITY.
* To use register names with standard convension, please use DOMED_SCICTRL8_PRIORITY.
*/
#define DOMED_PRIORITY8 (DOMED_SCICTRL8_PRIORITY)

