Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDom_reg.h
/** \brief 110, SCI ${i} Error Address Capture Register */
#define DOMED_SCICTRL8_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB700110u)
/** Alias (User Manual Name) for DOMED_SCICTRL8_ERRADDR.
* To use register names with standard convension, please use DOMED_SCICTRL8_ERRADDR.
*/
#define DOMED_ERRADDR8 (DOMED_SCICTRL8_ERRADDR)

/** \brief 118, SCI ${i} Error Capture Register */
#define DOMED_SCICTRL8_ERR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB700118u)
/** Alias (User Manual Name) for DOMED_SCICTRL8_ERR.
* To use register names with standard convension, please use DOMED_SCICTRL8_ERR.
*/
#define DOMED_ERR8 (DOMED_SCICTRL8_ERR)

/** \brief 120, Protocol Error Control Register ${i} */
#define DOMED_SCICTRL9_PECON /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB700120u)
/** Alias (User Manual Name) for DOMED_SCICTRL9_PECON.
* To use register names with standard convension, please use DOMED_SCICTRL9_PECON.
*/
#define DOMED_PECON9 (DOMED_SCICTRL9_PECON)

/** \brief 128, SCI ${i} Arbiter Priority Register */
#define DOMED_SCICTRL9_PRIORITY /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB700128u)
/** Alias (User Manual Name) for DOMED_SCICTRL9_PRIORITY.
* To use register names with standard convension, please use DOMED_SCICTRL9_PRIORITY.
*/
#define DOMED_PRIORITY9 (DOMED_SCICTRL9_PRIORITY)

/** \brief 130, SCI ${i} Error Address Capture Register */
#define DOMED_SCICTRL9_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB700130u)
/** Alias (User Manual Name) for DOMED_SCICTRL9_ERRADDR.
* To use register names with standard convension, please use DOMED_SCICTRL9_ERRADDR.
*/
#define DOMED_ERRADDR9 (DOMED_SCICTRL9_ERRADDR)

/** \brief 138, SCI ${i} Error Capture Register */
#define DOMED_SCICTRL9_ERR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB700138u)
/** Alias (User Manual Name) for DOMED_SCICTRL9_ERR.
* To use register names with standard convension, please use DOMED_SCICTRL9_ERR.
*/
#define DOMED_ERR9 (DOMED_SCICTRL9_ERR)

/** \brief 140, Protocol Error Control Register ${i} */
#define DOMED_SCICTRL10_PECON /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB700140u)
/** Alias (User Manual Name) for DOMED_SCICTRL10_PECON.
* To use register names with standard convension, please use DOMED_SCICTRL10_PECON.
*/
#define DOMED_PECON10 (DOMED_SCICTRL10_PECON)

/** \brief 148, SCI ${i} Arbiter Priority Register */
#define DOMED_SCICTRL10_PRIORITY /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB700148u)
/** Alias (User Manual Name) for DOMED_SCICTRL10_PRIORITY.
* To use register names with standard convension, please use DOMED_SCICTRL10_PRIORITY.
*/
#define DOMED_PRIORITY10 (DOMED_SCICTRL10_PRIORITY)

/** \brief 150, SCI ${i} Error Address Capture Register */
#define DOMED_SCICTRL10_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB700150u)
/** Alias (User Manual Name) for DOMED_SCICTRL10_ERRADDR.
* To use register names with standard convension, please use DOMED_SCICTRL10_ERRADDR.
*/
#define DOMED_ERRADDR10 (DOMED_SCICTRL10_ERRADDR)

/** \brief 158, SCI ${i} Error Capture Register */
#define DOMED_SCICTRL10_ERR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB700158u)
/** Alias (User Manual Name) for DOMED_SCICTRL10_ERR.
* To use register names with standard convension, please use DOMED_SCICTRL10_ERR.
*/
#define DOMED_ERR10 (DOMED_SCICTRL10_ERR)

/** \brief 160, Protocol Error Control Register ${i} */
#define DOMED_SCICTRL11_PECON /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB700160u)
/** Alias (User Manual Name) for DOMED_SCICTRL11_PECON.
* To use register names with standard convension, please use DOMED_SCICTRL11_PECON.
*/
#define DOMED_PECON11 (DOMED_SCICTRL11_PECON)

/** \brief 168, SCI ${i} Arbiter Priority Register */
#define DOMED_SCICTRL11_PRIORITY /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB700168u)
/** Alias (User Manual Name) for DOMED_SCICTRL11_PRIORITY.
* To use register names with standard convension, please use DOMED_SCICTRL11_PRIORITY.
*/
#define DOMED_PRIORITY11 (DOMED_SCICTRL11_PRIORITY)

/** \brief 170, SCI ${i} Error Address Capture Register */
#define DOMED_SCICTRL11_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB700170u)
/** Alias (User Manual Name) for DOMED_SCICTRL11_ERRADDR.
* To use register names with standard convension, please use DOMED_SCICTRL11_ERRADDR.
*/
#define DOMED_ERRADDR11 (DOMED_SCICTRL11_ERRADDR)

/** \brief 178, SCI ${i} Error Capture Register */
#define DOMED_SCICTRL11_ERR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB700178u)
/** Alias (User Manual Name) for DOMED_SCICTRL11_ERR.
* To use register names with standard convension, please use DOMED_SCICTRL11_ERR.
*/
#define DOMED_ERR11 (DOMED_SCICTRL11_ERR)

/** \brief 180, Protocol Error Control Register ${i} */
#define DOMED_SCICTRL12_PECON /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB700180u)
/** Alias (User Manual Name) for DOMED_SCICTRL12_PECON.
* To use register names with standard convension, please use DOMED_SCICTRL12_PECON.
*/
#define DOMED_PECON12 (DOMED_SCICTRL12_PECON)

/** \brief 188, SCI ${i} Arbiter Priority Register */
#define DOMED_SCICTRL12_PRIORITY /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB700188u)
/** Alias (User Manual Name) for DOMED_SCICTRL12_PRIORITY.
* To use register names with standard convension, please use DOMED_SCICTRL12_PRIORITY.
*/
#define DOMED_PRIORITY12 (DOMED_SCICTRL12_PRIORITY)

/** \brief 190, SCI ${i} Error Address Capture Register */
#define DOMED_SCICTRL12_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB700190u)
/** Alias (User Manual Name) for DOMED_SCICTRL12_ERRADDR.
* To use register names with standard convension, please use DOMED_SCICTRL12_ERRADDR.
*/
#define DOMED_ERRADDR12 (DOMED_SCICTRL12_ERRADDR)

/** \brief 198, SCI ${i} Error Capture Register */
#define DOMED_SCICTRL12_ERR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB700198u)
/** Alias (User Manual Name) for DOMED_SCICTRL12_ERR.
* To use register names with standard convension, please use DOMED_SCICTRL12_ERR.
*/
#define DOMED_ERR12 (DOMED_SCICTRL12_ERR)

/** \brief 1A0, Protocol Error Control Register ${i} */
#define DOMED_SCICTRL13_PECON /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB7001A0u)
/** Alias (User Manual Name) for DOMED_SCICTRL13_PECON.
* To use register names with standard convension, please use DOMED_SCICTRL13_PECON.
*/
#define DOMED_PECON13 (DOMED_SCICTRL13_PECON)

/** \brief 1A8, SCI ${i} Arbiter Priority Register */
#define DOMED_SCICTRL13_PRIORITY /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB7001A8u)
/** Alias (User Manual Name) for DOMED_SCICTRL13_PRIORITY.
* To use register names with standard convension, please use DOMED_SCICTRL13_PRIORITY.
*/
#define DOMED_PRIORITY13 (DOMED_SCICTRL13_PRIORITY)

/** \brief 1B0, SCI ${i} Error Address Capture Register */
#define DOMED_SCICTRL13_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB7001B0u)
/** Alias (User Manual Name) for DOMED_SCICTRL13_ERRADDR.
* To use register names with standard convension, please use DOMED_SCICTRL13_ERRADDR.
*/
#define DOMED_ERRADDR13 (DOMED_SCICTRL13_ERRADDR)

/** \brief 1B8, SCI ${i} Error Capture Register */
#define DOMED_SCICTRL13_ERR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB7001B8u)
/** Alias (User Manual Name) for DOMED_SCICTRL13_ERR.
* To use register names with standard convension, please use DOMED_SCICTRL13_ERR.
*/
#define DOMED_ERR13 (DOMED_SCICTRL13_ERR)

/** \brief 1C0, Protocol Error Control Register ${i} */
#define DOMED_SCICTRL14_PECON /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB7001C0u)
/** Alias (User Manual Name) for DOMED_SCICTRL14_PECON.
* To use register names with standard convension, please use DOMED_SCICTRL14_PECON.
*/
#define DOMED_PECON14 (DOMED_SCICTRL14_PECON)

/** \brief 1C8, SCI ${i} Arbiter Priority Register */
#define DOMED_SCICTRL14_PRIORITY /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB7001C8u)
/** Alias (User Manual Name) for DOMED_SCICTRL14_PRIORITY.
* To use register names with standard convension, please use DOMED_SCICTRL14_PRIORITY.
*/
#define DOMED_PRIORITY14 (DOMED_SCICTRL14_PRIORITY)

