Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDom_reg.h
/** \brief 1D0, SCI ${i} Error Address Capture Register */
#define DOMED_SCICTRL14_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB7001D0u)
/** Alias (User Manual Name) for DOMED_SCICTRL14_ERRADDR.
* To use register names with standard convension, please use DOMED_SCICTRL14_ERRADDR.
*/
#define DOMED_ERRADDR14 (DOMED_SCICTRL14_ERRADDR)

/** \brief 1D8, SCI ${i} Error Capture Register */
#define DOMED_SCICTRL14_ERR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB7001D8u)
/** Alias (User Manual Name) for DOMED_SCICTRL14_ERR.
* To use register names with standard convension, please use DOMED_SCICTRL14_ERR.
*/
#define DOMED_ERR14 (DOMED_SCICTRL14_ERR)

/** \brief 1E0, Protocol Error Control Register ${i} */
#define DOMED_SCICTRL15_PECON /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB7001E0u)
/** Alias (User Manual Name) for DOMED_SCICTRL15_PECON.
* To use register names with standard convension, please use DOMED_SCICTRL15_PECON.
*/
#define DOMED_PECON15 (DOMED_SCICTRL15_PECON)

/** \brief 1E8, SCI ${i} Arbiter Priority Register */
#define DOMED_SCICTRL15_PRIORITY /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB7001E8u)
/** Alias (User Manual Name) for DOMED_SCICTRL15_PRIORITY.
* To use register names with standard convension, please use DOMED_SCICTRL15_PRIORITY.
*/
#define DOMED_PRIORITY15 (DOMED_SCICTRL15_PRIORITY)

/** \brief 1F0, SCI ${i} Error Address Capture Register */
#define DOMED_SCICTRL15_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB7001F0u)
/** Alias (User Manual Name) for DOMED_SCICTRL15_ERRADDR.
* To use register names with standard convension, please use DOMED_SCICTRL15_ERRADDR.
*/
#define DOMED_ERRADDR15 (DOMED_SCICTRL15_ERRADDR)

/** \brief 1F8, SCI ${i} Error Capture Register */
#define DOMED_SCICTRL15_ERR /*lint --e(923)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB7001F8u)
/** Alias (User Manual Name) for DOMED_SCICTRL15_ERR.
* To use register names with standard convension, please use DOMED_SCICTRL15_ERR.
*/
#define DOMED_ERR15 (DOMED_SCICTRL15_ERR)

/** \brief 408, Identification Register */
#define DOMED_ID /*lint --e(923)*/ (*(volatile Ifx_DOM_ID*)0xFB700408u)

/** \brief 410, Protocol Error Status Register */
#define DOMED_PESTAT /*lint --e(923)*/ (*(volatile Ifx_DOM_PESTAT*)0xFB700410u)

/** \brief 418, Transaction ID Status Register */
#define DOMED_TIDSTAT /*lint --e(923)*/ (*(volatile Ifx_DOM_TIDSTAT*)0xFB700418u)

/** \brief 420, Transaction ID Enable Register */
#define DOMED_TIDEN /*lint --e(923)*/ (*(volatile Ifx_DOM_TIDEN*)0xFB700420u)

/** \brief 430,  */
#define DOMED_BRCON /*lint --e(923)*/ (*(volatile Ifx_DOM_BRCON*)0xFB700430u)

/** \brief 4F0, Access Enable Register 0 */
#define DOMED_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_DOM_ACCEN0*)0xFB7004F0u)

/** \brief 4F8, Access Enable Register 1 */
#define DOMED_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_DOM_ACCEN1*)0xFB7004F8u)

/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXDOM_REG_H */
